gcolombo-mchp/zephyr/drivers/ethernet/eth_pic32ck_gc_gmac.c
/*
 * Copyright (c) 2016 Piotr Mienkowski
 * Copyright (c) 2018 Antmicro Ltd
 * Copyright (c) 2023 Gerson Fernando Budke
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/** @file
 * @brief Atmel SAM MCU family Ethernet MAC (GMAC) driver.
 *
 * This is a zero-copy networking implementation of an Ethernet driver. To
 * prepare for the incoming frames the driver will permanently reserve a defined
 * amount of RX data net buffers when the interface is brought up and thus
 * reduce the total amount of RX data net buffers available to the application.
 *
 * Limitations:
 * - one shot PHY setup, no support for PHY disconnect/reconnect
 * - no statistics collection
 */

#include <zephyr/devicetree.h>
#define DT_DRV_COMPAT microchip_pic32ck_eth

/* Map SAM Kconfig names used by eth_sam_gmac_priv.h to PIC32CK equivalents */
#define CONFIG_ETH_SAM_GMAC_QUEUES        CONFIG_ETH_PIC32CK_GC_GMAC_QUEUES
#define CONFIG_ETH_SAM_GMAC_BUF_RX_COUNT  CONFIG_ETH_PIC32CK_GC_GMAC_BUF_RX_COUNT

#define LOG_MODULE_NAME eth_sam
#define LOG_LEVEL CONFIG_ETHERNET_LOG_LEVEL

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(LOG_MODULE_NAME);

#include <zephyr/cache.h>
#include <zephyr/kernel.h>
#include <zephyr/device.h>
#include <zephyr/sys/__assert.h>
#include <zephyr/sys/barrier.h>
#include <zephyr/sys/util.h>
#include <errno.h>
#include <stdbool.h>
#include <zephyr/net/phy.h>
#include <zephyr/net/net_pkt.h>
#include <zephyr/net/net_if.h>
#include <zephyr/net/ethernet.h>
#include <ethernet/eth_stats.h>
#include <zephyr/drivers/i2c.h>
#include <zephyr/drivers/pinctrl.h>
/* PIC32CK: no atmel_sam_pmc needed */
#include <soc.h>
#include "eth_sam_gmac_priv.h"

#include "eth.h"

#ifdef CONFIG_SOC_FAMILY_ATMEL_SAM0
#include "eth_sam0_gmac.h"
#endif

#include <zephyr/drivers/ptp_clock.h>
#include <zephyr/net/gptp.h>
#include <zephyr/irq.h>

#if defined(__DCACHE_PRESENT) || defined(CONFIG_DCACHE)
static bool dcache_enabled;

static inline void dcache_is_enabled(void)
{
#ifdef __DCACHE_PRESENT
	dcache_enabled = (SCB->CCR & SCB_CCR_DC_Msk);
#else
	dcache_enabled = true;
#endif
}
static inline void dcache_invalidate(uint32_t addr, uint32_t size)
{
	if (!dcache_enabled) {
		return;
	}

	/* Make sure it is aligned to 32B */
	uint32_t start_addr = addr & (uint32_t)~(GMAC_DCACHE_ALIGNMENT - 1);
	uint32_t size_full = size + addr - start_addr;

	sys_cache_data_invd_range((uint32_t *)start_addr, size_full);
}

static inline void dcache_clean(uint32_t addr, uint32_t size)
{
	if (!dcache_enabled) {
		return;
	}

	/* Make sure it is aligned to 32B */
	uint32_t start_addr = addr & (uint32_t)~(GMAC_DCACHE_ALIGNMENT - 1);
	uint32_t size_full = size + addr - start_addr;

	sys_cache_data_flush_range((uint32_t *)start_addr, size_full);
}
#else
#define dcache_is_enabled()
#define dcache_invalidate(addr, size)
#define dcache_clean(addr, size)
#endif

#ifdef CONFIG_SOC_FAMILY_ATMEL_SAM0
#define MCK_FREQ_HZ	SOC_ATMEL_SAM0_MCK_FREQ_HZ
#elif CONFIG_SOC_FAMILY_ATMEL_SAM
#define MCK_FREQ_HZ	SOC_ATMEL_SAM_MCK_FREQ_HZ
#elif defined(CONFIG_SOC_SAMA7G54)
#define MCK_FREQ_HZ	MHZ(125)
#elif defined(CONFIG_SOC_FAMILY_MICROCHIP_PIC32CK_SG_GC)
#define MCK_FREQ_HZ	120000000
#else
#error Unsupported SoC family
#endif

/*
 * Verify Kconfig configuration
 */
/* No need to verify things for unit tests */
#if !defined(CONFIG_NET_TEST)
#if CONFIG_NET_BUF_DATA_SIZE * CONFIG_ETH_SAM_GMAC_BUF_RX_COUNT \
	< GMAC_FRAME_SIZE_MAX
#error CONFIG_NET_BUF_DATA_SIZE * CONFIG_ETH_SAM_GMAC_BUF_RX_COUNT is \
	not large enough to hold a full frame
#endif

#if CONFIG_NET_BUF_DATA_SIZE * (CONFIG_NET_BUF_RX_COUNT - \
	CONFIG_ETH_SAM_GMAC_BUF_RX_COUNT) < GMAC_FRAME_SIZE_MAX
#error (CONFIG_NET_BUF_RX_COUNT - CONFIG_ETH_SAM_GMAC_BUF_RX_COUNT) * \
	CONFIG_NET_BUF_DATA_SIZE are not large enough to hold a full frame
#endif

#if CONFIG_NET_BUF_DATA_SIZE & 0x3F
#pragma message "CONFIG_NET_BUF_DATA_SIZE should be a multiple of 64 bytes " \
	"due to the granularity of RX DMA"
#endif

#if (CONFIG_ETH_SAM_GMAC_BUF_RX_COUNT + 1) * GMAC_ACTIVE_QUEUE_NUM \
	> CONFIG_NET_BUF_RX_COUNT
#error Not enough RX buffers to allocate descriptors for each HW queue
#endif
#endif /* !CONFIG_NET_TEST */

/* if GMAC_UR_MIM_RGMII (new for sama7g5) is defined, the media interface mode
 * supported are: mii, rmii and gmii. Otherwise mii and rmii are supported.
 */
#ifndef GMAC_UR_MIM_RGMII
#define SAM_GMAC_PHY_CONNECTION_TYPE_MAX 1
#else
#define SAM_GMAC_PHY_CONNECTION_TYPE_MAX 2
#endif

/* RX descriptors list */
#define DEFN_RX_DESC(n)									\
		static struct gmac_desc rx_desc##n##_que[PRIORITY_QUEUE_RX_DESC_COUNT]	\
			__nocache __aligned(GMAC_DESC_ALIGNMENT);

/* TX descriptors list */
#define DEFN_TX_DESC(n)									\
		static struct gmac_desc tx_desc##n##_que[PRIORITY_QUEUE_TX_DESC_COUNT]	\
			__nocache __aligned(GMAC_DESC_ALIGNMENT);

/* RX buffer accounting list */
#define DEFN_RX_FRAG(n)									\
		static struct net_buf *rx_frag_list##n##_que[PRIORITY_QUEUE_RX_DESC_COUNT];

#if GMAC_MULTIPLE_TX_PACKETS == 1
/* TX buffer accounting list */
#define DEFN_TX_FRAG(n)									\
		static struct net_buf *tx_frag_list##n##_que[PRIORITY_QUEUE_TX_DESC_COUNT];

#if  defined(CONFIG_PTP_CLOCK_SAM_GMAC)
#define NET_PKT_PER_QUE (CONFIG_NET_PKT_TX_COUNT + 1)
/* TX frames accounting list */
#define DEFN_TX_FRAME(n)								\
		static struct net_pkt *tx_frame_list##n##_que[NET_PKT_PER_QUE *		\
							      (GMAC_ACTIVE_PRIORITY_QUEUE_NUM + 1)];
#else
#define DEFN_TX_FRAME(n)
#endif /* CONFIG_PTP_CLOCK_SAM_GMAC */
#else
#define DEFN_TX_FRAG(n)
#define DEFN_TX_FRAME(n)
#endif /* GMAC_MULTIPLE_TX_PACKETS */

#define SAM_GMAC_LISTS_DEFN(n)								\
		DEFN_RX_DESC(n)								\
		DEFN_TX_DESC(n)								\
		DEFN_RX_FRAG(n)								\
		DEFN_TX_FRAG(n)								\
		DEFN_TX_FRAME(n)

#define MODULO_INC(val, max) {val = (++val < max) ? val : 0; }

static int rx_descriptors_init(Gmac *gmac, struct gmac_queue *queue);
static void tx_descriptors_init(Gmac *gmac, struct gmac_queue *queue);
static int nonpriority_queue_init(Gmac *gmac, struct gmac_queue *queue);

#if GMAC_PRIORITY_QUEUE_NUM >= 1
static inline void set_receive_buf_queue_pointer(Gmac *gmac,
						 struct gmac_queue *queue)
{
	/* Set Receive Buffer Queue Pointer Register */
	if (queue->que_idx == GMAC_QUE_0) {
		gmac->GMAC_RBQB = (uint32_t)queue->rx_desc_list.buf;
	} else {
		gmac->GMAC_RBQBAPQ[queue->que_idx - 1] =
			(uint32_t)queue->rx_desc_list.buf;
	}
}

static inline void disable_all_priority_queue_interrupt(Gmac *gmac)
{
	uint32_t idx;

