gcolombo-mchp/zephyr/drivers/ethernet/eth_pic32ck_gc_gmac.c
		return eth_sam_gmac_setup_qav_delta_bandwidth(gmac, queue_id,
							      delta_bandwidth);
	case ETHERNET_QAV_PARAM_TYPE_IDLE_SLOPE:
		idle_slope = config->qav_param.idle_slope;

		/* The standard uses bps, SAM GMAC uses Bps - convert now */
		idle_slope /= 8U;

		return eth_sam_gmac_setup_qav_idle_slope(gmac, queue_id,
							 idle_slope);
	default:
		break;
	}

	return -ENOTSUP;
}
#endif

static int eth_sam_gmac_set_config(const struct device *dev,
				   struct net_if *iface __unused,
				   enum ethernet_config_type type,
				   const struct ethernet_config *config)
{
	int result = 0;

	switch (type) {
#if GMAC_ACTIVE_PRIORITY_QUEUE_NUM >= 1
	case ETHERNET_CONFIG_TYPE_QAV_PARAM:
		return eth_sam_gmac_set_qav_param(dev, type, config);
#endif
	case ETHERNET_CONFIG_TYPE_MAC_ADDRESS:
	{
		struct eth_sam_dev_data *const dev_data = dev->data;
		const struct eth_sam_dev_cfg *const cfg = dev->config;

		memcpy(dev_data->mac_addr,
		       config->mac_address.addr,
		       sizeof(dev_data->mac_addr));

		/* Set MAC Address for frame filtering logic */
		mac_addr_set(cfg->regs, 0, dev_data->mac_addr);

		LOG_INF("%s MAC set to %02x:%02x:%02x:%02x:%02x:%02x",
			dev->name,
			dev_data->mac_addr[0], dev_data->mac_addr[1],
			dev_data->mac_addr[2], dev_data->mac_addr[3],
			dev_data->mac_addr[4], dev_data->mac_addr[5]);

		break;
	}
	default:
		result = -ENOTSUP;
		break;
	}

	return result;
}

#if GMAC_ACTIVE_PRIORITY_QUEUE_NUM >= 1
static int eth_sam_gmac_get_qav_param(const struct device *dev,
				      enum ethernet_config_type type,
				      struct ethernet_config *config)
{
	const struct eth_sam_dev_cfg *const cfg = dev->config;
	Gmac *gmac = cfg->regs;
	enum ethernet_qav_param_type qav_param_type;
	int queue_id;
	bool *enabled;
	unsigned int *idle_slope;
	unsigned int *delta_bandwidth;

	/* Priority queue IDs start from 1 for SAM GMAC */
	queue_id = config->qav_param.queue_id + 1;

	qav_param_type = config->qav_param.type;

	switch (qav_param_type) {
	case ETHERNET_QAV_PARAM_TYPE_STATUS:
		enabled = &config->qav_param.enabled;
		return eth_sam_gmac_get_qav_status(gmac, queue_id, enabled);
	case ETHERNET_QAV_PARAM_TYPE_IDLE_SLOPE:
		idle_slope = &config->qav_param.idle_slope;
		return eth_sam_gmac_get_qav_idle_slope(gmac, queue_id,
						       idle_slope);
	case ETHERNET_QAV_PARAM_TYPE_OPER_IDLE_SLOPE:
		idle_slope = &config->qav_param.oper_idle_slope;
		return eth_sam_gmac_get_qav_idle_slope(gmac, queue_id,
						       idle_slope);
	case ETHERNET_QAV_PARAM_TYPE_DELTA_BANDWIDTH:
		delta_bandwidth = &config->qav_param.delta_bandwidth;
		return eth_sam_gmac_get_qav_delta_bandwidth(gmac, queue_id,
							    delta_bandwidth);
	case ETHERNET_QAV_PARAM_TYPE_TRAFFIC_CLASS:
#if GMAC_ACTIVE_QUEUE_NUM == NET_TC_TX_COUNT
		config->qav_param.traffic_class = queue_id;
		return 0;
#else
		/* Invalid configuration - no direct TC to queue mapping */
		return -ENOTSUP;
#endif
	default:
		break;
	}

	return -ENOTSUP;
}
#endif

static int eth_sam_gmac_get_config(const struct device *dev,
				   struct net_if *iface __unused,
				   enum ethernet_config_type type,
				   struct ethernet_config *config)
{
	switch (type) {
	case ETHERNET_CONFIG_TYPE_PRIORITY_QUEUES_NUM:
		config->priority_queues_num = GMAC_ACTIVE_PRIORITY_QUEUE_NUM;
		return 0;
#if GMAC_ACTIVE_PRIORITY_QUEUE_NUM >= 1
	case ETHERNET_CONFIG_TYPE_QAV_PARAM:
		return eth_sam_gmac_get_qav_param(dev, type, config);
#endif
	default:
		break;
	}

	return -ENOTSUP;
}

#if defined(CONFIG_PTP_CLOCK_SAM_GMAC)
static const struct device *eth_sam_gmac_get_ptp_clock(const struct device *dev,
						      struct net_if *iface __unused)
{
	const struct eth_sam_dev_cfg *const cfg = dev->config;

	return cfg->ptp_clock;
}
#endif

static const struct ethernet_api eth_api = {
	.iface_api.init = eth_iface_init,

	.get_capabilities = eth_sam_gmac_get_capabilities,
	.set_config = eth_sam_gmac_set_config,
	.get_config = eth_sam_gmac_get_config,
	.get_phy = eth_sam_gmac_get_phy,
	.send = eth_tx,

#if defined(CONFIG_PTP_CLOCK_SAM_GMAC)
	.get_ptp_clock = eth_sam_gmac_get_ptp_clock,
#endif
};

#define DEFN_IRQ_CONFIG(n, x, name)							\
		IRQ_CONNECT(DT_INST_IRQ_BY_NAME(n, name, irq),				\
			DT_INST_IRQ_BY_NAME(n, name, priority),				\
			queue##x##_isr, DEVICE_DT_INST_GET(n), 0);			\
		irq_enable(DT_INST_IRQ_BY_NAME(n, name, irq));
#define DEFN_IRQ_CONFIG_0(n) DEFN_IRQ_CONFIG(n, 0, gmac)
#if GMAC_ACTIVE_PRIORITY_QUEUE_NUM >= 1
#define DEFN_IRQ_CONFIG_1(n) DEFN_IRQ_CONFIG(n, 1, q1)
#else
#define DEFN_IRQ_CONFIG_1(n)
#endif
#if GMAC_ACTIVE_PRIORITY_QUEUE_NUM >= 2
#define DEFN_IRQ_CONFIG_2(n) DEFN_IRQ_CONFIG(n, 2, q2)
#else
#define DEFN_IRQ_CONFIG_2(n)
#endif
#if GMAC_ACTIVE_PRIORITY_QUEUE_NUM >= 3
#define DEFN_IRQ_CONFIG_3(n) DEFN_IRQ_CONFIG(n, 3, q3)
#else
#define DEFN_IRQ_CONFIG_3(n)
#endif
#if GMAC_ACTIVE_PRIORITY_QUEUE_NUM >= 4
#define DEFN_IRQ_CONFIG_4(n) DEFN_IRQ_CONFIG(n, 4, q4)
#else
#define DEFN_IRQ_CONFIG_4(n)
#endif
#if GMAC_ACTIVE_PRIORITY_QUEUE_NUM >= 5
#define DEFN_IRQ_CONFIG_5(n) DEFN_IRQ_CONFIG(n, 5, q5)
#else
#define DEFN_IRQ_CONFIG_5(n)
#endif
#define SAM_GMAC_IRQ_CONFIG_DEFN(n)							\
		static void eth##n##_irq_config(void)					\
		{									\
			DEFN_IRQ_CONFIG_0(n)						\
			DEFN_IRQ_CONFIG_1(n)						\
			DEFN_IRQ_CONFIG_2(n)						\
			DEFN_IRQ_CONFIG_3(n)						\
			DEFN_IRQ_CONFIG_4(n)						\
			DEFN_IRQ_CONFIG_5(n)						\
		}

#define SAM_GMAC_PINCTRL_DEFN(n) PINCTRL_DT_INST_DEFINE(n);

#ifdef CONFIG_SOC_FAMILY_ATMEL_SAM
#define CFG_CLK_DEFN(n) .clock_cfg = SAM_DT_CLOCK_PMC_CFG(0, DT_INST_PARENT(n)),
#else
#define CFG_CLK_DEFN(n)
#endif

#define SAM_GMAC_CFG_DEFN(n)								\
		BUILD_ASSERT(DT_INST_ENUM_IDX(n, phy_connection_type) <=		\
			     SAM_GMAC_PHY_CONNECTION_TYPE_MAX,				\
			     "Invalid PHY connection");					\
		IF_ENABLED(CONFIG_PTP_CLOCK_SAM_GMAC,					\
			(DEVICE_DECLARE(gmac_ptp_clock_##n);))				\
		static const struct eth_sam_dev_cfg eth##n##_config = {			\
			.regs = (Gmac *)DT_REG_ADDR(DT_INST_PARENT(n)),			\
			.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(n),			\
			CFG_CLK_DEFN(n)							\
			.config_func = eth##n##_irq_config,				\
			.phy_dev = DEVICE_DT_GET(DT_INST_PHANDLE(n, phy_handle)),	\
			.num_queues = DT_INST_PROP(n, num_queues),			\
			.phy_conn_type = DT_INST_ENUM_IDX(n, phy_connection_type),	\
			.ref_clk_source = DT_INST_ENUM_IDX(n, ref_clk_source),		\
			.mcfg = NET_ETH_MAC_DT_INST_CONFIG_INIT(n),			\
			IF_ENABLED(CONFIG_PTP_CLOCK_SAM_GMAC,				\
				(.ptp_clock = DEVICE_GET(gmac_ptp_clock_##n),))		\
		};

#define DEFN_RX_FLAG_LIST_0(n)								\
		.rx_frag_list = &rx_frag_list##n##_que[PRIORITY_QUEUE0_RX_DESC_IDX],
#if (GMAC_PRIORITY_QUEUE_NUM >= 1) && (GMAC_ACTIVE_PRIORITY_QUEUE_NUM >= 1)
#define DEFN_RX_FLAG_LIST_1(n)								\
		.rx_frag_list = &rx_frag_list##n##_que[PRIORITY_QUEUE1_RX_DESC_IDX],
#else
#define DEFN_RX_FLAG_LIST_1(n)
#endif
#if (GMAC_PRIORITY_QUEUE_NUM >= 2) && (GMAC_ACTIVE_PRIORITY_QUEUE_NUM >= 2)
#define DEFN_RX_FLAG_LIST_2(n)								\
		.rx_frag_list = &rx_frag_list##n##_que[PRIORITY_QUEUE2_RX_DESC_IDX],
#else
#define DEFN_RX_FLAG_LIST_2(n)
#endif
#if (GMAC_PRIORITY_QUEUE_NUM >= 3) && (GMAC_ACTIVE_PRIORITY_QUEUE_NUM >= 3)
#define DEFN_RX_FLAG_LIST_3(n)								\
		.rx_frag_list = &rx_frag_list##n##_que[PRIORITY_QUEUE3_RX_DESC_IDX],
#else
#define DEFN_RX_FLAG_LIST_3(n)
#endif
#if (GMAC_PRIORITY_QUEUE_NUM >= 4) && (GMAC_ACTIVE_PRIORITY_QUEUE_NUM >= 4)
#define DEFN_RX_FLAG_LIST_4(n)								\
		.rx_frag_list = &rx_frag_list##n##_que[PRIORITY_QUEUE4_RX_DESC_IDX],
#else
#define DEFN_RX_FLAG_LIST_4(n)
#endif
#if (GMAC_PRIORITY_QUEUE_NUM >= 5) && (GMAC_ACTIVE_PRIORITY_QUEUE_NUM >= 5)
#define DEFN_RX_FLAG_LIST_5(n)								\
		.rx_frag_list = &rx_frag_list##n##_que[PRIORITY_QUEUE5_RX_DESC_IDX],
#else
#define DEFN_RX_FLAG_LIST_5(n)
#endif

#if GMAC_MULTIPLE_TX_PACKETS == 1
#define BUF_TX_FRAG_LIST_QUE(n, x)							\
		(uint32_t *)&tx_frag_list##n##_que[PRIORITY_QUEUE##x##_TX_DESC_IDX]
#define DEFN_TX_FLAG_LIST(n, x)								\
		.tx_frag_list = {							\
			.buf = BUF_TX_FRAG_LIST_QUE(n, x),				\
			.len = MAIN_QUEUE_TX_DESC_COUNT,				\
		},

