gcolombo-mchp/zephyr/drivers/ethernet/eth_pic32ck_gc_gmac.c
#if defined(CONFIG_PTP_CLOCK_SAM_GMAC)
#define BUF_TX_FRAME_LIST_QUE(n, x) (uint32_t *)&tx_frame_list##n##_que[x * NET_PKT_PER_QUE]
#define DEFN_TX_FRAME_LIST(n, x)							\
		.tx_frames = {								\
			.buf = BUF_TX_FRAME_LIST_QUE(n, x),				\
			.len = NET_PKT_PER_QUE,						\
		},
#else /* CONFIG_PTP_CLOCK_SAM_GMAC */
#define DEFN_TX_FRAME_LIST(n, x)
#endif /* CONFIG_PTP_CLOCK_SAM_GMAC */
#else /*GMAC_MULTIPLE_TX_PACKETS*/
#define DEFN_TX_FLAG_LIST(n, x)
#define DEFN_TX_FRAME_LIST(n, x)
#endif /*GMAC_MULTIPLE_TX_PACKETS*/

#define BUF_RX_DESC_QUE(n, x) &rx_desc##n##_que[PRIORITY_QUEUE##x##_RX_DESC_IDX]
#define BUF_TX_DESC_QUE(n, x) &tx_desc##n##_que[PRIORITY_QUEUE##x##_TX_DESC_IDX]
#define DEFN_DATA_QUEUE_LIST(n, x)							\
		{									\
			.que_idx = GMAC_QUE_##x,					\
			.rx_desc_list = {						\
				.buf = BUF_RX_DESC_QUE(n, x),				\
				.len = MAIN_QUEUE_RX_DESC_COUNT,			\
			},								\
			.tx_desc_list = {						\
				.buf = BUF_TX_DESC_QUE(n, x),				\
				.len = MAIN_QUEUE_TX_DESC_COUNT,			\
			},								\
			DEFN_RX_FLAG_LIST_##x(n)					\
			DEFN_TX_FLAG_LIST(n, x)						\
			DEFN_TX_FRAME_LIST(n, x)					\
		},
#define DEFN_DATA_QUEUE_LIST_0(n) DEFN_DATA_QUEUE_LIST(n, 0)
#if GMAC_PRIORITY_QUEUE_NUM >= 1

#define DEFN_DATA_QUEUE_LIST_1(n) DEFN_DATA_QUEUE_LIST(n, 1)
#else
#define DEFN_DATA_QUEUE_LIST_1(n)
#endif
#if GMAC_PRIORITY_QUEUE_NUM >= 2
#define DEFN_DATA_QUEUE_LIST_2(n) DEFN_DATA_QUEUE_LIST(n, 2)
#else
#define DEFN_DATA_QUEUE_LIST_2(n)
#endif
#if GMAC_PRIORITY_QUEUE_NUM >= 3
#define DEFN_DATA_QUEUE_LIST_3(n) DEFN_DATA_QUEUE_LIST(n, 3)
#else
#define DEFN_DATA_QUEUE_LIST_3(n)
#endif
#if GMAC_PRIORITY_QUEUE_NUM >= 4
#define DEFN_DATA_QUEUE_LIST_4(n) DEFN_DATA_QUEUE_LIST(n, 4)
#else
#define DEFN_DATA_QUEUE_LIST_4(n)
#endif
#if GMAC_PRIORITY_QUEUE_NUM >= 5
#define DEFN_DATA_QUEUE_LIST_5(n) DEFN_DATA_QUEUE_LIST(n, 5)
#else
#define DEFN_DATA_QUEUE_LIST_5(n)
#endif
#define SAM_GMAC_DATA_DEFN(n)								\
		BUILD_ASSERT(GMAC_QUEUE_NUM >= DT_INST_PROP(n, num_queues),		\
			     "The size of array queue_list[] is too small");		\
		static struct eth_sam_dev_data eth##n##_data = {			\
			.mac_addr = DT_INST_PROP_OR(n, local_mac_address, {0U}),	\
			.queue_list = {							\
				DEFN_DATA_QUEUE_LIST_0(n)				\
				DEFN_DATA_QUEUE_LIST_1(n)				\
				DEFN_DATA_QUEUE_LIST_2(n)				\
				DEFN_DATA_QUEUE_LIST_3(n)				\
				DEFN_DATA_QUEUE_LIST_4(n)				\
				DEFN_DATA_QUEUE_LIST_5(n)				\
			},								\
		};

#define SAM_GMAC_DT_INST_DEFN(n)							\
		ETH_NET_DEVICE_DT_INST_DEFINE(n,					\
					      eth_initialize, NULL, &eth##n##_data,	\
					      &eth##n##_config,				\
					      CONFIG_ETH_INIT_PRIORITY, &eth_api,	\
					      GMAC_MTU);

#if defined(CONFIG_PTP_CLOCK_SAM_GMAC)
static int ptp_clock_sam_gmac_set(const struct device *dev,
				  struct net_ptp_time *tm)
{
	const struct eth_sam_dev_cfg *const cfg = dev->config;
	Gmac *gmac = cfg->regs;

	gmac->GMAC_TSH = tm->_sec.high & 0xffff;
	gmac->GMAC_TSL = tm->_sec.low & 0xffffffff;
	gmac->GMAC_TN = tm->nanosecond & 0xffffffff;

	return 0;
}

static int ptp_clock_sam_gmac_get(const struct device *dev,
				  struct net_ptp_time *tm)
{
	const struct eth_sam_dev_cfg *const cfg = dev->config;
	Gmac *gmac = cfg->regs;

	tm->second = ((uint64_t)(gmac->GMAC_TSH & 0xffff) << 32) | gmac->GMAC_TSL;
	tm->nanosecond = gmac->GMAC_TN;

	return 0;
}

static int ptp_clock_sam_gmac_adjust(const struct device *dev, int increment)
{
	const struct eth_sam_dev_cfg *const cfg = dev->config;
	Gmac *gmac = cfg->regs;

	if ((increment <= -(int)NSEC_PER_SEC) || (increment >= (int)NSEC_PER_SEC)) {
		return -EINVAL;
	}

	if (increment < 0) {
		gmac->GMAC_TA = GMAC_TA_ADJ | GMAC_TA_ITDT(-increment);
	} else {
		gmac->GMAC_TA = GMAC_TA_ITDT(increment);
	}

	return 0;
}

static int ptp_clock_sam_gmac_rate_adjust(const struct device *dev,
					  double ratio)
{
	return -ENOTSUP;
}

static DEVICE_API(ptp_clock, ptp_api) = {
	.set = ptp_clock_sam_gmac_set,
	.get = ptp_clock_sam_gmac_get,
	.adjust = ptp_clock_sam_gmac_adjust,
	.rate_adjust = ptp_clock_sam_gmac_rate_adjust,
};

#define SAM_GMAC_PTP_CLOCK_DEFN(n)							\
		DEVICE_DEFINE(gmac_ptp_clock_##n, PTP_CLOCK_NAME, NULL,			\
			NULL, &eth##n##_data, &eth##n##_config, POST_KERNEL,		\
			CONFIG_ETH_INIT_PRIORITY, &ptp_api);
#else
#define SAM_GMAC_PTP_CLOCK_DEFN(n)
#endif /* CONFIG_PTP_CLOCK_SAM_GMAC */

#define ETH_SAM_GMAC_DEVICE(n)								\
		SAM_GMAC_LISTS_DEFN(n)							\
											\
		SAM_GMAC_IRQ_CONFIG_DEFN(n)						\
		SAM_GMAC_PINCTRL_DEFN(n)						\
											\
		SAM_GMAC_CFG_DEFN(n)							\
		SAM_GMAC_DATA_DEFN(n)							\
											\
		SAM_GMAC_DT_INST_DEFN(n)						\
											\
		SAM_GMAC_PTP_CLOCK_DEFN(n)

DT_INST_FOREACH_STATUS_OKAY(ETH_SAM_GMAC_DEVICE)
